Revit 2024 API
SpatialElementTag.Location Property
The location of the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override Location Location { get; }
Visual Basic
Public Overrides ReadOnly Property Location As Location
	Get
Visual C++
public:
virtual property Location^ Location {
	Location^ get () override;
}
Remarks
Allows you to get and set the location of the tag within the level. The Z location should be the elevation of the level and is not changeable.
See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace